podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/MPU_MKM14ZA5_R8.svd.xml
<!--
Devices using this peripheral: 
      MKM14Z5
      MKM33Z5
      MKM34Z5
-->
      <peripheral>
         <?sourceFile "MPU_MKM14ZA5_R8" ?>
         <name>MPU</name>
         <description>Memory protection unit</description>
         <groupName>MPU</groupName>
         <headerStructName>MPU</headerStructName>
         <baseAddress>0x4000A000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x10</offset>
            <size>0x10</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x400</offset>
            <size>0x80</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x800</offset>
            <size>0x20</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CESR</name>
               <description>Control/Error Status Register</description>
               <addressOffset>0x0</addressOffset>
               <resetValue>0x812001</resetValue>
               <fields>
                  <field>
                     <name>VLD</name>
                     <description>Valid</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>MPU is disabled. All accesses from all bus masters are allowed</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>MPU is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NRGD</name>
                     <description>Number Of Region Descriptors</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0000</name>
                           <description>8 region descriptors</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0001</name>
                           <description>12 region descriptors</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0010</name>
                           <description>16 region descriptors</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NSP</name>
                     <description>Number Of Slave Ports</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>HRL</name>
                     <description>Hardware Revision Level</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SPERR</name>
                     <description>Slave Port n Error</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No error has occurred for slave port n</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>An error has occurred for slave port n</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>2</dim>
               <dimIncrement>8</dimIncrement>
               <dimIndex>0,1</dimIndex>
               <name>SP,@p@f@i</name>
               <addressOffset>0x10</addressOffset>
               <register>
                  <name>EAR</name>
                  <description>Error Address Register, Slave Port n</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetMask>0x0</resetMask>
                  <fields>
                     <field>
                        <name>EADDR</name>
                        <description>Error Address</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>EDR</name>
                  <description>Error Detail Register, Slave Port n</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <resetMask>0x0</resetMask>
                  <fields>
                     <field>
                        <name>ERW</name>
                        <description>Error Read/Write</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>Read</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Write</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>EATTR</name>
                        <description>Error Attributes</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b000</name>
                              <description>User mode, instruction access</description>
                              <value>0b000</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b001</name>
                              <description>User mode, data access</description>
                              <value>0b001</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b010</name>
                              <description>Supervisor mode, instruction access</description>
                              <value>0b010</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b011</name>
                              <description>Supervisor mode, data access</description>
                              <value>0b011</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>EMN</name>
                        <description>Error Master Number</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>EPID</name>
                        <description>Error Process Identification</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>EACD</name>
                        <description>Error Access Control Detail</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <cluster>
               <dim>8</dim>
               <dimIncrement>16</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
               <name>RGD,@p@a@i_@f</name>
               <addressOffset>0x400</addressOffset>
               <register>
                  <name>WORD0</name>
                  <description>Region Descriptor n, Word 0</description>
                  <addressOffset>0x0</addressOffset>
                  <fields>
                     <field>
                        <name>SRTADDR</name>
                        <description>Start Address</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>27</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>WORD1</name>
                  <description>Region Descriptor n, Word 1</description>
                  <addressOffset>0x4</addressOffset>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                     <field>
                        <name>ENDADDR</name>
                        <description>End Address</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>27</bitWidth>
                     </field>
                  </fields>
               </register>
